# Loading and Saving Data!

## pd_read...

    Métodos para ler os dados (entrada) 

## df_to_...

    Método para salvar os dados (saída)

![load](https://media.giphy.com/media/RHEqKwRZDwFKE/giphy.gif)

In [2]:
#Primeiro, como sempre, carregamos as bibliotecas

import numpy as np
import pandas as pd

In [ ]:
pd.read_(tab) # para verificar os diponíveis

In [2]:
pd.read_excel?

### Carregando os dados:

#### O mais comum de todos: Lendo um CSV (Arquivo separado por vírgulas)

In [3]:
#se o arquivo estiver na mesma pasta de trabalho: pd.read_csv(nome do arquivo)
df = pd.read_csv('countries of the world.csv')
print(df.shape)
df.head(2)

(227, 20)

,Country,Region,Population,Area (sq. mi.),Pop. Density (per sq. mi.),Coastline (coast/area ratio),Net migration,Infant mortality (per 1000 births),GDP ($ per capita),Literacy (%),Phones (per 1000),Arable (%),Crops (%),Other (%),Climate,Birthrate,Deathrate,Agriculture,Industry,Service
0,Afghanistan,ASIA (EX. NEAR EAST),31056997,647500,"48,0","0,00","23,06","163,07",700.0,"36,0","3,2","12,13","0,22","87,65",1,"46,6","20,34","0,38","0,24","0,38"
1,Albania,EASTERN EUROPE,3581655,28748,"124,6","1,26","-4,93","21,52",4500.0,"86,5","71,2","21,09","4,42","74,49",3,"15,11","5,22","0,232","0,188","0,579"

In [5]:
#se o arquivo estiver em outra pasta: pd.read_csv(caminho até o arquivo/nome do arquivo)
df = pd.read_csv(r'C:\Users\rodribia\GitHub\My_Projects\1 Aulas Data Science\Data Sets/Poke.csv')
print(df.shape)
df.head(2)

(800, 13)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False

In [9]:
# 'Escape sequence'
string = 'Olá, tudo bem? \n Meu nome é rodrigo'
string2 = r'Olá, tudo bem? \n Meu nome é rodrigo'

print(string)
print('')
print(string2)

Olá, tudo bem?
 Meu nome é rodrigo

Olá, tudo bem? \n Meu nome é rodrigo

In [11]:
#Lendo direto de um site (sem baixar o arquivo)
url_csv = 'https://vincentarelbundock.github.io/Rdatasets/csv/boot/amis.csv'
df = pd.read_csv(url_csv)
print(df.shape)
df.head(2)

(8437, 5)

   Unnamed: 0  speed  period  warning  pair
0           1     26       1        1     1
1           2     26       1        1     1

### Outro tipo de arquivo comum: Excel

In [12]:
pd.read_excel('Planilha.xlsx')

   Coluna A  Coluna B  Coluna C  Coluna D
0        10        15        10        20
1        11        20        50        20
2        23        51        51        12
3        23        21        20        20
4        56        32        15        21

In [13]:
#Caso queria uma aba específica: (por padrão pega a primeira)
pd.read_excel('Planilha.xlsx',sheet_name='sheet1')

   Coluna A  Coluna B  Coluna C  Coluna D
0        10        15        10        20
1        11        20        50        20
2        23        51        51        12
3        23        21        20        20
4        56        32        15        21

In [14]:
pd.read_excel('Planilha.xlsx',sheet_name='sheet2')

    346     3465  3456  35
0    123     454   456   456
1    234  436765   765   467
2   3241     456  4567  7654
3  54325      42   567  3546
4    123     435   456  7654

In [15]:
#Caso seus dados não tenham cabeçalho
pd.read_excel('Planilha.xlsx',sheet_name='sheet2', header=None)

       0       1     2     3
0    346    3465  3456    35
1    123     454   456   456
2    234  436765   765   467
3   3241     456  4567  7654
4  54325      42   567  3546
5    123     435   456  7654

In [16]:
#Caso seus dados não tenham cabeçalho e eu queria dar um nome para eles
pd.read_excel('Planilha.xlsx',sheet_name='sheet2', header=None, names=['a','b','c','d'])

       a       b     c     d
0    346    3465  3456    35
1    123     454   456   456
2    234  436765   765   467
3   3241     456  4567  7654
4  54325      42   567  3546
5    123     435   456  7654

### Ler HTML é muito útil para retirar alguma informação direto de algum site:

In [8]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

#Observação: retorna uma lista de Dataframes com as tabelas do site

In [58]:
#df.head()

In [18]:
print(df[0].shape)
df[0].head()

(556, 7)

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","August 22, 2019"
1,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"
2,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","August 12, 2019"
3,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","January 29, 2019"
4,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"

In [20]:
df = pd.read_html('http://www.cultura.ufpa.br/dicas/htm/htm-cor2.htm', header=0)[0]
print(df.shape)
df.head()

(454, 3)

   Nome da cor    Base 10  Base 16
0         Snow  255250250  #FFFAFA
1   GhostWhite  248248255  #F8F8FF
2   WhiteSmoke  245245245  #F5F5F5
3    Gainsboro  220220220  #DCDCDC
4  FloralWhite  255250240  #FFFAF0

### Ler o clipboard, ou seja, ler o que está no seu CTRL+C, também é útil para agilizar alguma atividade!

In [22]:
pd.read_clipboard()

   Nome          da        cor     Base  10  Base.1  16
0     0        Snow  255250250  #FFFAFA NaN     NaN NaN
1     1  GhostWhite  248248255  #F8F8FF NaN     NaN NaN
2     2  WhiteSmoke  245245245  #F5F5F5 NaN     NaN NaN

In [23]:
pd.read_clipboard(header=None)

,0,1,2,3,4,5,6,7,8,9,10
0,Ler,um,Banco,de,Dados,"(Oracle,","Mysql,","Mongodb,","Nosql,","sqllite,",etc...)

### Ler um Banco de Dados (Oracle, Mysql, Mongodb, Nosql, sqllite, etc...)

    pd.read_sql(sql, connection)
    
* sql = Query do banco de dados
* connection = Conecção ou engine com o banco de dados

In [22]:
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://username:password@localhost:3306/db_name')

query = ''' select Coluna from Tabela  '''

df = pd.read_sql_query(query, engine)

In [ ]:
import mysql.connector

mydb = mysql.connector.connect(
    host = 'host',
    user = 'username',
    passwd = 'pass',
    database = 'db_name'
)

query = 'select Coluna from Tabela'

df = pd.read_sql(query, mydb)

### Lendo dados por 'chunks'

In [24]:
# US fatal road accident data for automobiles, 1998 to 2010

url = 'https://raw.githubusercontent.com/vincentarelbundock/Rdatasets/master/csv/gamclass/FARS.csv'

df = pd.read_csv(url)
df.shape

(151158, 18)

In [91]:
df.head(2)

,Unnamed: 0,caseid,state,age,airbag,injury,restraint,sex,inimpact,modelyr,airbagAvail,airbagDeploy,Restraint,D_injury,D_airbagAvail,D_airbagDeploy,D_Restraint,year
0,1998.3,1:1:2,1,20,30,3,1,2,12,1991,no,no,yes,3,no,no,yes,1998
1,1998.5,1:2:1,1,41,30,2,0,1,2,1987,no,no,no,2,no,no,no,1998

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 151158 entries, 0 to 151157
Data columns (total 18 columns):
Unnamed: 0        151158 non-null float64
caseid            151158 non-null object
state             151158 non-null int64
age               151158 non-null int64
airbag            151158 non-null int64
injury            151158 non-null int64
restraint         151158 non-null int64
sex               151158 non-null int64
inimpact          151158 non-null int64
modelyr           151158 non-null int64
airbagAvail       151158 non-null object
airbagDeploy      151158 non-null object
Restraint         151158 non-null object
D_injury          151158 non-null int64
D_airbagAvail     151158 non-null object
D_airbagDeploy    151158 non-null object
D_Restraint       151158 non-null object
year              151158 non-null int64
dtypes: float64(1), int64(10), object(7)
memory usage: 20.8+ MB

#### Processando por 'chunks':

    chunksize = 10000
    for chunk in pd.read_csv(filename, chunksize=chunksize):
        process(chunk)

In [26]:
chunksize = 50000
for chunk in pd.read_csv(url, chunksize=chunksize):
    print(chunk.shape)

(50000, 18)
(50000, 18)
(50000, 18)
(1158, 18)

### Lendo dados comprimidos

In [27]:
caminho = r'C:\Users\rodribia\GitHub\My_Projects\1 Aulas Data Science\Data Sets/videogamesales.zip'
df = pd.read_csv(caminho)
df.head(10)

,Rank,Name,Platform,Year,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales
0,1,Wii Sports,Wii,2006.0,Sports,Nintendo,41.49,29.02,3.77,8.46,82.74
1,2,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24
2,3,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.85,12.88,3.79,3.31,35.82
3,4,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.75,11.01,3.28,2.96,33.00
4,5,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37
5,6,Tetris,GB,1989.0,Puzzle,Nintendo,23.20,2.26,4.22,0.58,30.26
6,7,New Super Mario Bros.,DS,2006.0,Platform,Nintendo,11.38,9.23,6.50,2.90,30.01
7,8,Wii Play,Wii,2006.0,Misc,Nintendo,14.03,9.20,2.93,2.85,29.02
8,9,New Super Mario Bros. Wii,Wii,2009.0,Platform,Nintendo,14.59,7.06,4.70,2.26,28.62
9,10,Duck Hunt,NES,1984.0,Shooter,Nintendo,26.93,0.63,0.28,0.47,28.31

### Salvando os dados:

In [97]:
#Primeiro, vamos criar um novo dataframe:

dicionário = {
    "Col_A":(1,2,3),
    "Col_B":(3,2,1),
    "Col_C":(6,6,6)
}

df = pd.DataFrame(dicionário)
df

   Col_A  Col_B  Col_C
0      1      3      6
1      2      2      6
2      3      1      6

#### Para salvar, acessamos o método to_(nome da extesão) do DataFrame,
#### alguns exemplos comuns:

* df.to_csv
* df.to_html
* df.to_excel
* df.to_clipboard
* df.to_json

In [ ]:
df.to_<tab>

In [99]:
df.to_html('nome_do_arquivo.html')

In [100]:
df.to_csv('nome_do_arquivo.csv')

# Bonus

## Qual a melhor maneira de salvar e carregar nossos dados no formato DataFrame?

https://towardsdatascience.com/the-best-format-to-save-pandas-data-414dca023e0d

![fig](https://miro.medium.com/max/678/1*6qdaUz8pMFTurG7N14SQjA.png)

![fi2](https://miro.medium.com/max/678/1*-QoJbusw3MUYdms0lbmd4Q.png)

In [28]:
# US fatal road accident data for automobiles, 1998 to 2010

url = 'https://raw.githubusercontent.com/vincentarelbundock/Rdatasets/master/csv/gamclass/FARS.csv'

df = pd.read_csv(url)
df.shape

(151158, 18)

In [29]:
df.to_pickle('pickle')

In [30]:
pd.read_pickle('pickle')
df.shape

(151158, 18)